analogdevicesinc/no-OS/drivers/platform/stm32/stm32_i3c.c
/***************************************************************************//**
 *   @file   stm32/stm32_i3c.c
 *   @brief  Implementation of stm32 I3C driver.
 *   @author Jorge Marques (jorge.marques@analog.com)
********************************************************************************
 * Copyright 2024(c) Analog Devices, Inc.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. Neither the name of Analog Devices, Inc. nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY ANALOG DEVICES, INC. “AS IS” AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO
 * EVENT SHALL ANALOG DEVICES, INC. BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*******************************************************************************/
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include "no_os_util.h"
#include "no_os_alloc.h"
#include "no_os_i3c.h"
#include "stm32_i3c.h"
#include "stm32_dma.h"

/**
 * @struct stm32_i3c_dma_ctx
 * @brief STM32 platform specific I3C DMA context descriptor.
 */
struct stm32_i3c_dma_ctx {
	/** I3C instance */
	struct no_os_i3c_desc *desc;
	/** Control Register DMA transfer descriptor */
	struct no_os_dma_xfer_desc cr_ch_xfer;
	/** Tx DMA transfer descriptor */
	struct no_os_dma_xfer_desc *tx_ch_xfer;
	/** Rx DMA transfer descriptor */
	struct no_os_dma_xfer_desc *rx_ch_xfer;
	/** User callback to be called after all transactions */
	void (*dma_user_cb)(void *);
	/** User callback context */
	void *dma_user_ctx;
};

volatile bool i3c_dma_cplt[NO_OS_I3C_MAX_BUS_NUMBER] = {false};

static HAL_StatusTypeDef stm32_i3c_xfer_complete_cb(I3C_HandleTypeDef *,
		uint32_t);
void stm32_i3c_dma_callback(struct no_os_dma_xfer_desc *,
			    struct no_os_dma_xfer_desc *,
			    void *);
static int32_t stm32_i3c_config_extra(struct no_os_i3c_desc *desc,
				      struct stm32_i3c_device_desc *xdesc);
static int32_t stm32_i3c_populate_dma_context(struct no_os_i3c_desc *desc,
		struct no_os_i3c_msg *msgs,
		uint32_t len,
		void (*callback)(void *),
		void *ctx);
static int32_t stm32_i3c_dma_config(struct stm32_i3c_bus_desc *xdesc,
				    struct stm32_i3c_dma_ctx *dma_ctx, uint32_t tx_count, uint32_t rx_count);
static inline void stm32_i3c_find_i3c_table(I3C_HandleTypeDef *hi3c,
		struct no_os_i3c_bus_desc **iter);
static inline int32_t stm32_i3c_wait_ready(I3C_HandleTypeDef *hi3c);

/**
 * @brief I3C target request a dynamic address callback.
 * When called, assigns a dynamic address to the target.
 * @param hi3c - Pointer to an I3C_HandleTypeDef structure that contains the
 * configuration information for the specified I3C.
 * @param targetPayload - The {BCR, DCR, PID} yielded by the device during
 * the DAA.
 */
void HAL_I3C_TgtReqDynamicAddrCallback(I3C_HandleTypeDef *hi3c,
				       uint64_t targetPayload)
{
	uint8_t addr;
	uint64_t pid;
	struct no_os_i3c_bus_desc *it;
	uint8_t i, j;

	no_os_memswap64(&targetPayload, sizeof(targetPayload), sizeof(targetPayload));
	pid = STM32_I3C_TP_PID(targetPayload);

	stm32_i3c_find_i3c_table(hi3c, &it);
	if (!it)
		return;

	/* Search for device with pid */
	for (i = 0 ; i < NO_OS_I3C_MAX_DEV_NUMBER; i++) {
		if (pid == it->daa_candidates[i].pid)
			break;
	}

	if (i == NO_OS_I3C_MAX_DEV_NUMBER) {
		/* Device is unknown */
		/* No error handling, #free_addr >> #devs_on_bus */
		addr = no_os_i3c_addr_get_free(it, 8);
		if (HAL_I3C_Ctrl_SetDynAddr(hi3c, addr) != HAL_OK)
			return;
		j = (it)->num_devs_unknown;
		(it)->daa_unknown[j].pid = pid;
		(it)->daa_unknown[j].addr = addr;
		(it)->daa_unknown[j].is_attached = 1;
		if (j < NO_OS_I3C_MAX_DEV_NUMBER - 1)
			(it)->num_devs_unknown++;
	} else {
		/* Device is known */
		addr = (it)->daa_candidates[i].addr;
		if (HAL_I3C_Ctrl_SetDynAddr(hi3c, addr) != HAL_OK)
			return;
		(it)->daa_candidates[i].is_attached = 1;
	}

	/* Send associated dynamic address */
	no_os_i3c_addr_set_status(it, addr, NO_OS_I3C_ADDR_SLOT_I3C_DEV);

	/* Don't store BCR and DCR, device_desc may not be initialized */
}

/**
 * @brief Controller dynamic address assignment Complete callback.
 * @param hi3c - Pointer to an I3C_HandleTypeDef structure that contains the
 * configuration information for the specified I3C.
 */
void HAL_I3C_CtrlDAACpltCallback(I3C_HandleTypeDef *hi3c) {}
/**
 * @brief Controller Transmit Complete callback.
 * @param hi3c - Pointer to an I3C_HandleTypeDef structure that contains the
 * configuration information for the specified I3C.
 */
void HAL_I3C_CtrlTxCpltCallback(I3C_HandleTypeDef *hi3c) {}

/**
 * @brief Controller Reception Complete callback.
 * @param hi3c - Pointer to an I3C_HandleTypeDef structure that contains the
 * configuration information for the specified I3C.
 */
void HAL_I3C_CtrlRxCpltCallback(I3C_HandleTypeDef *hi3c) {}

/*
 * @brief Error callback.
 * @param hi3c - Pointer to an I3C_HandleTypeDef structure that contains the
 * configuration information for the specified I3C.
 */
void HAL_I3C_ErrorCallback(I3C_HandleTypeDef *hi3c) {}

