analogdevicesinc/no-OS/drivers/platform/stm32/stm32_i3c.c
/*
 * @brief When the multiple transfer of CCC, I3C private or I2C transfer is
 * completed callback.
 * @param hi3c - Pointer to an I3C_HandleTypeDef structure that contains the
 * configuration information for the specified I3C.
 */
void HAL_I3C_CtrlMultipleXferCpltCallback(I3C_HandleTypeDef *hi3c) {}

/*
 * @brief Callback for asynchronous events, like IBI and Hot-join.
 * @param hi3c - Pointer to an I3C_HandleTypeDef structure that contains the
 * configuration information for the specified I3C.
 * @param eventId - Event identifier.
 */
void HAL_I3C_NotifyCallback(I3C_HandleTypeDef *hi3c, uint32_t eventId)
{
	struct no_os_i3c_bus_desc *it;

	stm32_i3c_find_i3c_table(hi3c, &it);
	if (!it)
		return;

	if ((eventId & EVENT_ID_IBI) == EVENT_ID_IBI)
		it->irq_events |= NO_OS_I3C_IRQ_IBI;
	if ((eventId & EVENT_ID_HJ) == EVENT_ID_HJ)
		it->irq_events |= NO_OS_I3C_IRQ_HJ;
	if ((eventId & EVENT_ID_CR) == EVENT_ID_CR)
		it->irq_events |= NO_OS_I3C_IRQ_CR;

	if (it->async_irq)
		no_os_i3c_call_irq(it);

	return;
}

/**
 * @brief Initialize the I3C device.
 * @param desc - The I3C device descriptor.
 * @param param - The structure that contains the I3C parameters (unused).
 * @return 0 in case of success, error code otherwise.
 */
int stm32_i3c_init(struct no_os_i3c_desc *desc,
		   const struct no_os_i3c_init_param *param)
{
	struct stm32_i3c_device_desc *xdesc;

	if (!desc)
		return -EINVAL;

	xdesc = (struct stm32_i3c_device_desc *)no_os_calloc(1,
			sizeof(struct stm32_i3c_device_desc));
	if (!xdesc)
		return -ENOMEM;

	if (stm32_i3c_config_extra(desc, xdesc)) {
		no_os_free(xdesc);
		return -EIO;
	}

	desc->extra = xdesc;

	return 0;
}

/**
 * @brief Initialize the I3C bus.
 * @param desc - The I3C bus descriptor.
 * @param param - The structure that contains the I3C parameters.
 * @return 0 in case of success, error code otherwise.
 */
int stm32_i3c_init_bus(struct no_os_i3c_bus_desc *desc,
		       const struct no_os_i3c_bus_init_param *param)
{
	struct stm32_i3c_init_param *bus_init;
	struct stm32_i3c_bus_desc *xdesc;

	if (!desc || !param)
		return -EINVAL;

	switch (param->device_id) {
#if defined(I3C1)
	case 1:
		break;
#endif
#if defined(I3C2)
	case 2:
		break;
#endif
#if defined(I3C3)
	case 3:
		break;
#endif
	default:
		return -EINVAL;
	};

	xdesc = (struct stm32_i3c_bus_desc *)no_os_calloc(1,
			sizeof(struct stm32_i3c_bus_desc));
	if (!xdesc)
		return -ENOMEM;

	bus_init = param->extra;
	xdesc->hi3c = bus_init->hi3c;
	xdesc->irq_id = bus_init->irq_id;
	xdesc->i3c_dma_desc = bus_init->i3c_dma_desc;
	desc->extra = xdesc;

	return 0;
}

/**
 * @brief Do I3C DAA to assign the dynamic addresses.
 * @param desc - The I3C bus descriptor.
 * @param rstdaa - Unassigned the DA of devices already assigned.
 * @return 0 in case of success, error code otherwise.
 */
int stm32_i3c_do_daa(struct no_os_i3c_bus_desc *desc, bool rstdaa)
{
	struct stm32_i3c_bus_desc *xdesc;

	if (!desc || !desc->extra)
		return -EINVAL;

	xdesc = desc->extra;
	if (HAL_I3C_Ctrl_DynAddrAssign_IT(xdesc->hi3c,
					  rstdaa ? I3C_RSTDAA_THEN_ENTDAA : I3C_ONLY_ENTDAA) != HAL_OK)
		return -EIO;

	/*
	 * Wait DAA to finish.
	 */
	while (HAL_I3C_GetState(xdesc->hi3c) != HAL_I3C_STATE_READY) {}

	return 0;
}

/**
 * @brief Free the resources allocated by stm32_i3c_init().
 * @param desc - The I3C  device descriptor.
 * @return 0 in case of success, -EINVAL otherwise.
 */
int stm32_i3c_remove(struct no_os_i3c_desc *desc)
{
	if (!desc)
		return -EINVAL;

	if (desc->extra) {
		no_os_free(desc->extra);
		desc->extra = NULL;
	}

	return 0;
}

/**
 * @brief Deinit I3C bus and free resources allocated by stm32_i3c_init_bus().
 * @param desc - The I3C  bus descriptor.
 * @return 0 in case of success, -EINVAL otherwise.
 */
int stm32_i3c_remove_bus(struct no_os_i3c_bus_desc *desc)
{
	struct stm32_i3c_bus_desc *xdesc;

	if (!desc)
		return -EINVAL;

	if (desc->extra) {
		xdesc = desc->extra;
		HAL_I3C_DeInit(xdesc->hi3c);
		no_os_free(desc->extra);
		desc->extra = NULL;
	}

	return 0;
}

/**
 * @brief Send CCC as bus.
 * Retrieve data is only valid for unicast commands.
 * Multi frames are not supported such as:
 * * Read CCCs with a defining bytes.
 * @param desc - The I3C descriptor.
 * @param addr - Address to send to.
 * @param id - CCC ID.
 * @param rnw - True if the CCC should retrieve data from the device.
 * @param defining - Contain defining byte.
 * @param data - The buffer with the data to transmit.
 * @param size - Number of bytes in the buffer.
 * @return 0 in case of success, error code otherwise.
 */
int stm32_i3c_send_ccc(struct no_os_i3c_bus_desc *desc,
		       uint8_t addr,
		       uint8_t id,
		       bool rnw,
		       bool defining,
		       uint8_t *data,
		       uint8_t size)
{
	int ret;
	struct stm32_i3c_bus_desc *xdesc;
	bool bcast;
	uint32_t option;
	/* Buffers are filled by the HAL. */
	/* CtrlBuf size requirements:
	 * Direct CCC: CtrlBuf.Size >= 2*#frames
	 * Broadcast CCC: CtrlBuf.Size >= #frames
	 */
	uint32_t ctrl_buffer[2];
	uint8_t tx_buffer[0xF];
	uint8_t rx_buffer[0xF];

	if (size > sizeof(rx_buffer) / sizeof(uint8_t))
		return -ENOMEM;
	/* Dual frames not implemented */
	if (rnw & defining)
		return -EOPNOTSUPP;

	bcast = addr == NO_OS_I3C_BCAST_ADDR;

	I3C_CCCTypeDef ccc_descriptor = {
		/* TargetAddr, CCC Value */
		(bcast ? 0 : addr), id,
		/* {CCC data + defbyte pointer, CCC size + defining} */
		{rnw ? NULL : data, size + defining},
		/* Direction */
		(rnw ? HAL_I3C_DIRECTION_READ : HAL_I3C_DIRECTION_WRITE)
	};

	if (!desc || !desc->extra || !data)
		return -EINVAL;

	xdesc = desc->extra;
	xdesc->xfer.CtrlBuf.pBuffer = ctrl_buffer;
	xdesc->xfer.CtrlBuf.Size = sizeof(ctrl_buffer) / sizeof(uint32_t);
	/*
	 * Rx/TxBuf.Size is the sum of all I3C_CCCTypeDef {CCC size + byte}.
	 */
	xdesc->xfer.RxBuf.pBuffer = rx_buffer;
	xdesc->xfer.TxBuf.pBuffer = tx_buffer;
	if (rnw) {
		xdesc->xfer.TxBuf.Size = 0;
		xdesc->xfer.RxBuf.Size = size;
	} else {
		xdesc->xfer.TxBuf.Size = size + defining;
		xdesc->xfer.RxBuf.Size = 0;
	}

	if (defining) {
		option = (bcast ? I3C_BROADCAST_WITH_DEFBYTE_STOP :
			  I3C_DIRECT_WITH_DEFBYTE_STOP);
	} else {
		option = (bcast ? I3C_BROADCAST_WITHOUT_DEFBYTE_STOP :
			  I3C_DIRECT_WITHOUT_DEFBYTE_STOP);
	}
	if (HAL_I3C_AddDescToFrame(xdesc->hi3c,
				   &ccc_descriptor,
				   NULL,
				   &xdesc->xfer,
				   1,
				   option
				  ) != HAL_OK)
		return -EIO;

	if (rnw) {
		while (HAL_I3C_Ctrl_ReceiveCCC_IT(xdesc->hi3c, &xdesc->xfer) != HAL_OK) {}
	} else {
		while (HAL_I3C_Ctrl_TransmitCCC_IT(xdesc->hi3c, &xdesc->xfer) != HAL_OK) {}
	}

	ret = stm32_i3c_wait_ready(xdesc->hi3c);
	if (ret)
		return ret;

	/* If receive, copy read value */
	if (rnw) memcpy(data, rx_buffer, size);

