analogdevicesinc/no-OS/drivers/platform/stm32/stm32_i3c.c
	return 0;
}

/**
 * @brief I3C private write transaction as bus.
 * @param desc - The I3C descriptor.
 * @param data - The buffer with the data to transmit.
 * @param data_len - Number of bytes in the buffer.
 * @return 0 in case of success, -EINVAL or -EIO otherwise.
 */
int stm32_i3c_write(struct no_os_i3c_desc *desc,
		    uint8_t *data,
		    uint8_t data_len)
{
	struct stm32_i3c_bus_desc *xdesc;
	uint32_t ctrl_buffer;
	I3C_PrivateTypeDef private_descriptor = {
		desc->addr, {data, data_len}, {NULL, 0}, HAL_I3C_DIRECTION_WRITE
	};

	if (!desc || !desc->bus || !desc->bus->extra || !data)
		return -EINVAL;

	xdesc = desc->bus->extra;
	xdesc->xfer.CtrlBuf.pBuffer = &ctrl_buffer;
	xdesc->xfer.CtrlBuf.Size = 1;
	xdesc->xfer.TxBuf.pBuffer = data;
	xdesc->xfer.TxBuf.Size = data_len;

	if (HAL_I3C_AddDescToFrame(xdesc->hi3c,
				   NULL,
				   &private_descriptor,
				   &xdesc->xfer,
				   xdesc->xfer.CtrlBuf.Size,
				   desc->is_i3c ?
				   I3C_PRIVATE_WITHOUT_ARB_RESTART : I2C_PRIVATE_WITHOUT_ARB_RESTART
				  ) != HAL_OK)
		return -EIO;

	if (HAL_I3C_Ctrl_Transmit_IT(xdesc->hi3c, &xdesc->xfer) != HAL_OK)
		return -EIO;

	return stm32_i3c_wait_ready(xdesc->hi3c);
}

/**
 * @brief I3C private read transaction as bus.
 * @param desc - The I3C descriptor.
 * @param data - The buffer where received data is to be stored.
 * @param data_len - Number of bytes to receive.
 * @return 0 in case of success, -EINVAL or -EIO otherwise.
 */
int stm32_i3c_read(struct no_os_i3c_desc *desc,
		   uint8_t *data,
		   uint8_t data_len)
{
	struct stm32_i3c_bus_desc *xdesc;
	uint32_t ctrl_buffer;
	I3C_PrivateTypeDef private_descriptor = {desc->addr, {NULL, 0}, {data, data_len}, HAL_I3C_DIRECTION_READ};

	if (!desc || !desc->bus || !desc->bus->extra || !data)
		return -EINVAL;

	xdesc = desc->bus->extra;
	xdesc->xfer.CtrlBuf.pBuffer = &ctrl_buffer;
	xdesc->xfer.CtrlBuf.Size = 1;
	xdesc->xfer.RxBuf.pBuffer = data;
	xdesc->xfer.RxBuf.Size = data_len;

	if (HAL_I3C_AddDescToFrame(xdesc->hi3c,
				   NULL,
				   &private_descriptor,
				   &xdesc->xfer,
				   xdesc->xfer.CtrlBuf.Size,
				   desc->is_i3c ?
				   I3C_PRIVATE_WITHOUT_ARB_RESTART : I2C_PRIVATE_WITHOUT_ARB_RESTART
				  ) != HAL_OK)
		return -EIO;

	if (HAL_I3C_Ctrl_Receive_IT(xdesc->hi3c, &xdesc->xfer) != HAL_OK)
		return -EIO;

	return stm32_i3c_wait_ready(xdesc->hi3c);
}

/**
 * @brief I3C private write and read transaction as bus.
 * @param desc - The I3C descriptor.
 * @param tx_data - The buffer with the transmitted data.
 * @param tx_data_len - Number of bytes to write.
 * @param rx_data - The buffer with the received data.
 * @param rx_data_len - Number of bytes to read.
 * @return 0 in case of success, -EINVAL or -EIO otherwise.
 */
int stm32_i3c_write_and_read(struct no_os_i3c_desc *desc,
			     uint8_t *tx_data,
			     uint8_t tx_data_len,
			     uint8_t *rx_data,
			     uint8_t rx_data_len)
{
	struct stm32_i3c_bus_desc *xdesc;
	I3C_ControlTypeDef ctrl_buffer;
	I3C_PrivateTypeDef private_descriptor = {desc->addr, {tx_data, tx_data_len}, {rx_data, rx_data_len}, HAL_I3C_DIRECTION_BOTH};

	if (!desc || !desc->bus || !desc->bus->extra || !tx_data || !rx_data)
		return -EINVAL;

	xdesc = desc->bus->extra;
	xdesc->xfer.CtrlBuf.pBuffer = (uint32_t *)&ctrl_buffer;
	xdesc->xfer.CtrlBuf.Size = 1;
	xdesc->xfer.TxBuf.pBuffer = tx_data;
	xdesc->xfer.TxBuf.Size = tx_data_len;
	xdesc->xfer.RxBuf.pBuffer = rx_data;
	xdesc->xfer.RxBuf.Size = rx_data_len;

	if (HAL_I3C_AddDescToFrame(xdesc->hi3c,
				   NULL,
				   &private_descriptor,
				   &xdesc->xfer,
				   xdesc->xfer.CtrlBuf.Size,
				   desc->is_i3c ?
				   I3C_PRIVATE_WITHOUT_ARB_STOP : I2C_PRIVATE_WITHOUT_ARB_STOP
				  ) != HAL_OK)
		return -EIO;

	if (HAL_I3C_Ctrl_Receive_IT(xdesc->hi3c, &xdesc->xfer) != HAL_OK)
		return -EIO;

	return stm32_i3c_wait_ready(xdesc->hi3c);
}

/**
 * @brief Check if I3C device is ready.
 * @param desc - The I3C descriptor.
 * @return 0 in case of success, -EIO in case of error.
 */
int stm32_i3c_is_dev_ready(struct no_os_i3c_desc* desc)
{
	struct stm32_i3c_bus_desc *xdesc;

	if (!desc || !desc->bus || !desc->bus->extra)
		return -EINVAL;

	xdesc = desc->bus->extra;
	if (HAL_I3C_Ctrl_IsDeviceI3C_Ready(xdesc->hi3c, desc->addr, 300,
					   1000) != HAL_OK)
		return -EIO;
	return 0;
}

/**
 * @brief Configure I3C interrupts.
 * @param desc - The I3C descriptor.
 * @param irq - The interrupt type to enable/disable.
 * @param en - 1 to enable, 0 to disable irq type.
 * @return 0 in case of success, error code otherwise.
 */
int stm32_i3c_conf_irq(struct no_os_i3c_bus_desc* desc,
		       uint8_t irq, bool en)
{
	struct stm32_i3c_bus_desc *xdesc;
	uint32_t value;

	if (!desc || !desc->extra)
		return -EINVAL;

	switch (irq) {
	case NO_OS_I3C_IRQ_IBI:
		value = HAL_I3C_IT_IBIIE;
		break;
	case NO_OS_I3C_IRQ_HJ:
		value = HAL_I3C_IT_HJIE;
		break;
	case NO_OS_I3C_IRQ_CR:
		value = HAL_I3C_IT_CRIE;
		break;
	default:
		return -EINVAL;
	}

	xdesc = desc->extra;
	if (en) {
		if (HAL_I3C_ActivateNotification(xdesc->hi3c, NULL, value) != HAL_OK)
			return -EIO;
	} else {
		if (HAL_I3C_DeactivateNotification(xdesc->hi3c, value) != HAL_OK)
			return -EIO;
	}

	return 0;
}

/**
 * @brief Update I3C CCC info.
 * @param desc - The I3C descriptor.
 * @param irq - The interrupt type to update the field.
 * @return 0 in case of success, error code otherwise.
 */
int stm32_i3c_get_ccc_info(struct no_os_i3c_bus_desc* desc,
			   uint8_t irq)
{
	struct stm32_i3c_bus_desc *xdesc;
	uint32_t event;

	switch (irq) {
	case NO_OS_I3C_IRQ_IBI:
		event = EVENT_ID_IBI;
		break;
	case NO_OS_I3C_IRQ_HJ:
		event = EVENT_ID_CR;
		break;
	case NO_OS_I3C_IRQ_CR:
		event = EVENT_ID_HJ;
		break;
	default:
		return -EINVAL;
	}

	xdesc = desc->extra;
	if (HAL_I3C_GetCCCInfo(xdesc->hi3c, event, &xdesc->ccc_info) != HAL_OK)
		return -EIO;

	desc->ccc_info.ibi_cr_addr = xdesc->ccc_info.IBICRTgtAddr;
	desc->ccc_info.ibi_payload_len = xdesc->ccc_info.IBITgtNbPayload;
	desc->ccc_info.ibi_payload = xdesc->ccc_info.IBITgtPayload;

	desc->irq_events &= ~irq;

