analogdevicesinc/no-OS/drivers/platform/stm32/stm32_i3c.c
	return 0;
}

/**
 * @brief Configure and start a series of transfers using DMA.
 * @param desc - The I3C descriptor.
 * @param msgs - The messages array.
 * @param len - Number of messages.
 * @param callback - Function to be invoked after transfers.
 * @param ctx - User defined parameter for the callback function.
 * @return 0 in case of success, errno codes otherwise.
 */
int32_t stm32_i3c_transfer_dma_async(struct no_os_i3c_desc *desc,
				     struct no_os_i3c_msg *msgs,
				     uint32_t len,
				     void (*callback)(void *),
				     void *ctx)
{
	int ret = 0;
	uint32_t i, tx_count, rx_count;
	struct stm32_i3c_bus_desc *xdesc;
	I3C_HandleTypeDef *hi3c;
	struct stm32_i3c_dma_ctx *dma_ctx;
	uint32_t txdma_priority, rxdma_priority, i3c_priority;

	if (!desc || !msgs)
		return -EINVAL;

	if (!desc->bus->extra)
		return -EINVAL;

	xdesc = (struct stm32_i3c_bus_desc *) desc->bus->extra;
	hi3c = xdesc->hi3c;
	tx_count = 0;
	rx_count = 0;

	/* DMA transfer is not supported if DMA descriptor iunavailable */
	if (!xdesc->i3c_dma_desc)
		return -ENOTSUP;
	/* A transfer is ongoing if private data exists */
	if (xdesc->i3c_dma_desc->priv)
		return -EBUSY;

	/* check on the Mode */
	if (hi3c->Mode != HAL_I3C_MODE_CONTROLLER) {
		hi3c->ErrorCode = HAL_I3C_ERROR_NOT_ALLOWED;
		return -ENOTSUP;
	}
	/* Check on hdmacr handle */
	else if (xdesc->i3c_dma_desc->crdma_ch == NULL) {
		hi3c->ErrorCode = HAL_I3C_ERROR_DMA_PARAM;
		return -EINVAL;
	}
	/* check on the State */
	else if ((hi3c->State != HAL_I3C_STATE_READY)
		 && (hi3c->State != HAL_I3C_STATE_LISTEN)) {
		return -EBUSY;
	}

	/* Verify and count the messages */
	for (i = 0; i < len; i++) {
		if (((msgs[i].tx_buff == NULL) && (msgs[i].tx_size != 0U)) ||
		    ((msgs[i].rx_buff == NULL) && (msgs[i].rx_size != 0U))) {
			return -EINVAL;
		}
		if (msgs[i].tx_buff)
			tx_count++;
		if (msgs[i].rx_buff)
			rx_count++;
	}

	if (tx_count && !xdesc->i3c_dma_desc->txdma_ch)
		return -EINVAL;
	if (rx_count && !xdesc->i3c_dma_desc->rxdma_ch)
		return -EINVAL;
	dma_ctx = (struct stm32_i3c_dma_ctx *) no_os_calloc(1,
			sizeof(struct stm32_i3c_dma_ctx));
	if (!dma_ctx)
		return -ENOMEM;

	/* Fill the DMA Context */
	xdesc->i3c_dma_desc->priv = (void *) dma_ctx;
	ret = stm32_i3c_populate_dma_context(desc, msgs, len, callback, ctx);
	if (ret)
		goto free_dma_ctx;

	/* Set handle transfer parameters */
	hi3c->ErrorCode     = HAL_I3C_ERROR_NONE;
	hi3c->XferISR       = stm32_i3c_xfer_complete_cb;
	hi3c->ControlXferCount = len;

	if ((tx_count == 0) && (rx_count == 0))
		hi3c->State         = HAL_I3C_STATE_BUSY;
	else if (rx_count == 0)
		hi3c->State         = HAL_I3C_STATE_BUSY_TX;
	else if (tx_count == 0)
		hi3c->State         = HAL_I3C_STATE_BUSY_RX;
	else
		hi3c->State         = HAL_I3C_STATE_BUSY_TX_RX;

	/* Enable Tx process (frame complete and error) interrupts */
	hi3c->Instance->IER |= (HAL_I3C_IT_FCIE | HAL_I3C_IT_ERRIE);

	/* Enable control DMA Request */
	LL_I3C_EnableDMAReq_Control(hi3c->Instance);

	/* Enable Rx data DMA Request */
	if (rx_count != 0U) {
		LL_I3C_EnableDMAReq_RX(hi3c->Instance);
	}

	/* Enable Tx data DMA Request */
	if (tx_count != 0U) {
		LL_I3C_EnableDMAReq_TX(hi3c->Instance);
	}

	/* DMA Configure and Start */
	ret = stm32_i3c_dma_config(xdesc, dma_ctx, tx_count, rx_count);
	if (ret)
		goto abort_transfer;

	/*
	 * The priority of the I3C interrupt has to be lower than the DMA interrupt.
	 * The I3C interrupt waits until the DMA interrupt is received
	 * and then continues to write the next control word once the DMA transfer is
	 * configured.
	 */
	if (xdesc->i3c_dma_desc->txdma_ch) {
		no_os_irq_get_priority(xdesc->i3c_dma_desc->dma_desc->irq_ctrl,
				       xdesc->i3c_dma_desc->txdma_ch->irq_num,
				       &txdma_priority);
	} else {
		txdma_priority = 0;
	}
	if (xdesc->i3c_dma_desc->rxdma_ch) {
		no_os_irq_get_priority(xdesc->i3c_dma_desc->dma_desc->irq_ctrl,
				       xdesc->i3c_dma_desc->rxdma_ch->irq_num,
				       &rxdma_priority);
	} else {
		rxdma_priority = 0;
	}

	i3c_priority = txdma_priority > rxdma_priority ? txdma_priority + 1 :
		       rxdma_priority + 1;
	HAL_NVIC_SetPriority(xdesc->irq_id, i3c_priority, 0);

	i3c_dma_cplt[desc->bus->device_id] = false;
	/* Decrement remaining control buffer data counter */
	hi3c->ControlXferCount--;
	/* Initiate a Start condition */
	LL_I3C_RequestTransfer(hi3c->Instance);

	return ret;

abort_transfer:
	no_os_dma_xfer_abort(xdesc->i3c_dma_desc->dma_desc,
			     xdesc->i3c_dma_desc->crdma_ch);
	no_os_dma_xfer_abort(xdesc->i3c_dma_desc->dma_desc,
			     xdesc->i3c_dma_desc->txdma_ch);
	no_os_dma_xfer_abort(xdesc->i3c_dma_desc->dma_desc,
			     xdesc->i3c_dma_desc->rxdma_ch);
	no_os_free(dma_ctx->tx_ch_xfer);
	no_os_free(dma_ctx->rx_ch_xfer);
	no_os_free(dma_ctx->cr_ch_xfer.src);
free_dma_ctx:
	no_os_free(dma_ctx);
	return ret;
}

/**
 * @brief Abort the ongoing DMA transaction
 * @param desc - The I3C descriptor.
 * @return 0 in case of success, errno codes otherwise.
 */
int32_t stm32_i3c_transfer_abort(struct no_os_i3c_desc *desc)
{
	struct stm32_i3c_bus_desc *xdesc;
	struct stm32_i3c_dma_desc *i3c_dma_desc;
	struct stm32_i3c_dma_ctx *i3c_dma_ctx;

	if (!desc)
		return -EINVAL;

	if (!desc->bus->extra)
		return -ESRCH;

	xdesc = (struct stm32_i3c_bus_desc *) desc->bus->extra;
	i3c_dma_desc = (struct stm32_i3c_dma_desc *) xdesc->i3c_dma_desc;

	if (!i3c_dma_desc || !i3c_dma_desc->priv)
		return -EINVAL;

	i3c_dma_ctx = i3c_dma_desc->priv;

	/* Disable requested interrupts */
	__HAL_I3C_DISABLE_IT(xdesc->hi3c, (HAL_I3C_IT_FCIE | HAL_I3C_IT_ERRIE));
	/* Disable control DMA Request */
	LL_I3C_DisableDMAReq_Control(xdesc->hi3c->Instance);
	/* Disable Tx DMA Request */
	LL_I3C_DisableDMAReq_TX(xdesc->hi3c->Instance);
	/* Disable Rx DMA Request */
	LL_I3C_DisableDMAReq_RX(xdesc->hi3c->Instance);

	/* I3C DMA Abort Transfer */
	no_os_dma_xfer_abort(i3c_dma_desc->dma_desc, i3c_dma_desc->crdma_ch);

	if (i3c_dma_ctx->tx_ch_xfer) {
		no_os_dma_xfer_abort(i3c_dma_desc->dma_desc, i3c_dma_desc->txdma_ch);
		no_os_free(i3c_dma_ctx->tx_ch_xfer);
	}
	if (i3c_dma_ctx->rx_ch_xfer) {
		no_os_dma_xfer_abort(i3c_dma_desc->dma_desc, i3c_dma_desc->rxdma_ch);
		no_os_free(i3c_dma_ctx->rx_ch_xfer);
	}

	/* Flush the Tx FIFO */
	LL_I3C_RequestTxFIFOFlush(xdesc->hi3c->Instance);
	/* Flush the Rx FIFO */
	LL_I3C_RequestRxFIFOFlush(xdesc->hi3c->Instance);

	/* Clear frame complete flag */
	if (I3C_CHECK_FLAG(xdesc->hi3c->Instance->EVR, I3C_EVR_FCF) != RESET) {
		LL_I3C_ClearFlag_FC(xdesc->hi3c->Instance);
	}

