analogdevicesinc/no-OS/drivers/platform/stm32/stm32_i3c.c
	/* Check on previous state */
	if (xdesc->hi3c->PreviousState == HAL_I3C_STATE_LISTEN) {
		xdesc->hi3c->State = HAL_I3C_STATE_LISTEN;
	} else {
		xdesc->hi3c->State = HAL_I3C_STATE_READY;
	}

	no_os_free(i3c_dma_ctx->cr_ch_xfer.src);
	no_os_free(i3c_dma_ctx);
	/* Clear the private data to indicate DMA transfer is aborted */
	i3c_dma_desc->priv = NULL;

	return 0;
}

/**
 * @brief Configure the bus according the new device.
 * @param desc - The I3C device descriptor.
 * @return 0 in case of success, error code otherwise.
 */
static int32_t stm32_i3c_config_extra(struct no_os_i3c_desc *desc,
				      struct stm32_i3c_device_desc *xdesc)
{
	int ret = 0;
	I3C_DeviceConfTypeDef *dev_conf;
	struct stm32_i3c_bus_desc *mxdesc;
	struct no_os_i3c_desc **it;
	uint8_t dev_index = 0;
	uint8_t bcr;

	if (!desc->is_i3c)
		return 0;

	/* Get BCR info */
	ret = no_os_i3c_send_direct_ccc(desc, NO_OS_I3C_CCC_GETBCR, &bcr);
	if (ret)
		return ret;

	/* DeviceIndex is array position + 1, since 0 is the controller */
	it = desc->bus->devs;
	for (; it < desc->bus->devs + NO_OS_I3C_MAX_DEV_NUMBER; it++, dev_index++) {
		if (!*it)
			continue;
		if (*it == desc)
			break;
	};
	dev_conf = &(xdesc->dev_conf);
	dev_conf->DeviceIndex        = dev_index + 1;
	dev_conf->TargetDynamicAddr  = desc->addr;
	dev_conf->IBIAck             = NO_OS_I3C_BCR_IBI_REQUEST_CAPABLE(bcr);
	dev_conf->IBIPayload         = NO_OS_I3C_BCR_IBI_PAYLOAD(bcr);
	dev_conf->CtrlRoleReqAck     = NO_OS_I3C_BCR_DEVICE_ROLE(bcr);
	dev_conf->CtrlStopTransfer   = DISABLE;

	mxdesc = desc->bus->extra;
	if (HAL_I3C_Ctrl_ConfigBusDevices(mxdesc->hi3c, dev_conf, 1U) != HAL_OK)
		return -EIO;

	return 0;
}

/**
 * @brief Populate the context required for DMA transfer.
 * @param desc - The I3C descriptor.
 * @param msgs - The messages array.
 * @param len - Number of messages.
 * @param callback - Function to be invoked after transfers
 * @param ctx - User defined parameter for the callback function.
 * @param dma_ctx - The DMA context to be populated.
 * @return 0 in case of success, errno codes otherwise.
 */
static int32_t stm32_i3c_populate_dma_context(struct no_os_i3c_desc *desc,
		struct no_os_i3c_msg *msgs,
		uint32_t len,
		void (*callback)(void *),
		void *ctx)
{
	int32_t ret;
	uint32_t i = 0;
	uint32_t tx_count, rx_count, tx_idx, rx_idx;
	uint8_t *tx_addr, *rx_addr;
	struct stm32_i3c_dma_desc *i3c_dma_desc;
	struct stm32_i3c_dma_ctx *dma_ctx;
	I3C_HandleTypeDef *hi3c;

	if (!desc || !msgs)
		return -EINVAL;
	if (!desc->bus->extra)
		return -EINVAL;

	hi3c = ((struct stm32_i3c_bus_desc *) desc->bus->extra)->hi3c;
	i3c_dma_desc = ((struct stm32_i3c_bus_desc *) desc->bus->extra)->i3c_dma_desc;
	tx_count = 0;
	rx_count = 0;

	if (!i3c_dma_desc || !i3c_dma_desc->priv)
		return -EINVAL;

	dma_ctx = (struct stm32_i3c_dma_ctx *) i3c_dma_desc->priv;

	/* Verify and count the messages */
	for (i = 0; i < len; i++) {
		if (((msgs[i].tx_buff == NULL) && (msgs[i].tx_size != 0U)) ||
		    ((msgs[i].rx_buff == NULL) && (msgs[i].rx_size != 0U))) {
			return -EINVAL;
		}
		if (msgs[i].tx_buff)
			tx_count++;
		if (msgs[i].rx_buff)
			rx_count++;
	}

	dma_ctx->cr_ch_xfer.src = (uint8_t *) no_os_calloc(len, sizeof(uint32_t));
	if (!dma_ctx->cr_ch_xfer.src) {
		return -ENOMEM;
	}
	if (rx_count) {
		dma_ctx->rx_ch_xfer = no_os_calloc(rx_count, sizeof(*dma_ctx->rx_ch_xfer));
		if (!dma_ctx->rx_ch_xfer) {
			ret = -ENOMEM;
			goto free_cr_src;
		}
	}
	if (tx_count) {
		dma_ctx->tx_ch_xfer = no_os_calloc(tx_count, sizeof(*dma_ctx->tx_ch_xfer));
		if (!dma_ctx->tx_ch_xfer) {
			ret = -ENOMEM;
			goto free_rx_ch_xfer;
		}
	}

	/* Assign the address of TX and RX register depending on the memory alignment */
	if (tx_count)
		tx_addr = (((struct stm32_dma_channel *)
			    i3c_dma_desc->txdma_ch->extra)->mem_data_alignment == DATA_ALIGN_WORD) ?
			  (uint8_t *) & (hi3c->Instance->TDWR) :
			  (uint8_t *) & (hi3c->Instance->TDR);
	if (rx_count)
		rx_addr = (((struct stm32_dma_channel *)
			    i3c_dma_desc->rxdma_ch->extra)->mem_data_alignment == DATA_ALIGN_WORD) ?
			  (uint8_t *) & (hi3c->Instance->RDWR) :
			  (uint8_t *) & (hi3c->Instance->RDR);

	dma_ctx->cr_ch_xfer.dst = (uint8_t *) & (hi3c->Instance->CR);
	dma_ctx->cr_ch_xfer.length = len * sizeof(uint32_t);
	dma_ctx->cr_ch_xfer.xfer_type = MEM_TO_DEV;
	dma_ctx->cr_ch_xfer.xfer_complete_cb = NULL;
	dma_ctx->cr_ch_xfer.xfer_complete_ctx = dma_ctx;
	dma_ctx->cr_ch_xfer.periph = NO_OS_DMA_IRQ;
	dma_ctx->cr_ch_xfer.extra = NULL;

	/* Create the control words for all the transfer messages */
	for (i = 0, tx_idx = 0, rx_idx = 0; i < len; i++) {
		if (msgs[i].tx_buff) {
			dma_ctx->tx_ch_xfer[tx_idx].src = msgs[i].tx_buff;
			dma_ctx->tx_ch_xfer[tx_idx].dst = tx_addr;
			dma_ctx->tx_ch_xfer[tx_idx].length = msgs[i].tx_size;
			dma_ctx->tx_ch_xfer[tx_idx].xfer_type = MEM_TO_DEV;
			dma_ctx->tx_ch_xfer[tx_idx].xfer_complete_cb = stm32_i3c_dma_callback;
			dma_ctx->tx_ch_xfer[tx_idx].xfer_complete_ctx = dma_ctx;
			dma_ctx->tx_ch_xfer[tx_idx].periph = NO_OS_DMA_IRQ;
			dma_ctx->tx_ch_xfer[tx_idx].extra = NULL;
			tx_idx++;

			((uint32_t *)dma_ctx->cr_ch_xfer.src)[i] = I3C_CR_MEND |
					(2 << I3C_CR_MTYPE_Pos) |
					(desc->addr << I3C_CR_ADD_Pos) |
					(msgs[i].tx_size << I3C_CR_DCNT_Pos);
		} else {
			dma_ctx->rx_ch_xfer[rx_idx].src = rx_addr;
			dma_ctx->rx_ch_xfer[rx_idx].dst = msgs[i].rx_buff;
			dma_ctx->rx_ch_xfer[rx_idx].length = msgs[i].rx_size;
			dma_ctx->rx_ch_xfer[rx_idx].xfer_type = DEV_TO_MEM;
			dma_ctx->rx_ch_xfer[rx_idx].xfer_complete_cb = stm32_i3c_dma_callback;
			dma_ctx->rx_ch_xfer[rx_idx].xfer_complete_ctx = dma_ctx;
			dma_ctx->rx_ch_xfer[rx_idx].periph = NO_OS_DMA_IRQ;
			dma_ctx->rx_ch_xfer[rx_idx].extra = NULL;
			rx_idx++;

			((uint32_t *)dma_ctx->cr_ch_xfer.src)[i] = I3C_CR_MEND |
					(2 << I3C_CR_MTYPE_Pos) |
					(desc->addr << I3C_CR_ADD_Pos) |
					I3C_CR_RNW |
					(msgs[i].rx_size << I3C_CR_DCNT_Pos);
		}
	}

	dma_ctx->desc = desc;
	dma_ctx->dma_user_cb = callback;
	dma_ctx->dma_user_ctx = ctx;

