analogdevicesinc/no-OS/drivers/platform/stm32/stm32_i3c.c
	return 0;
free_rx_ch_xfer:
	no_os_free(dma_ctx->rx_ch_xfer);
free_cr_src:
	no_os_free(dma_ctx->cr_ch_xfer.src);

	return ret;
}

/**
 * @brief Configure and Start the DMA
 * @param xdesc - The STM32 I3C bus descriptor.
 * @param dma_ctx - The DMA context.
 * @param tx_count - Number of transmit messages.
 * @param rx_count - Number of receive messages.
 * @return 0 in case of success, error code otherwise.
 */
static int32_t stm32_i3c_dma_config(struct stm32_i3c_bus_desc *xdesc,
				    struct stm32_i3c_dma_ctx *dma_ctx, uint32_t tx_count, uint32_t rx_count)
{
	int32_t ret;

	if (!xdesc || !dma_ctx || !xdesc->i3c_dma_desc)
		return -EINVAL;

	/* DMA Configuration */
	ret = no_os_dma_config_xfer(xdesc->i3c_dma_desc->dma_desc, &dma_ctx->cr_ch_xfer,
				    1, xdesc->i3c_dma_desc->crdma_ch);
	if (ret)
		return ret;

	if (dma_ctx->rx_ch_xfer) {
		ret = no_os_dma_config_xfer(xdesc->i3c_dma_desc->dma_desc, dma_ctx->rx_ch_xfer,
					    rx_count, xdesc->i3c_dma_desc->rxdma_ch);
		if (ret)
			return ret;
	}
	if (dma_ctx->tx_ch_xfer) {
		ret = no_os_dma_config_xfer(xdesc->i3c_dma_desc->dma_desc, dma_ctx->tx_ch_xfer,
					    tx_count, xdesc->i3c_dma_desc->txdma_ch);
		if (ret)
			return ret;
	}

	/* TX and RX DMA Start */
	if (dma_ctx->rx_ch_xfer) {
		ret = no_os_dma_xfer_start(xdesc->i3c_dma_desc->dma_desc,
					   xdesc->i3c_dma_desc->rxdma_ch);
		if (ret)
			return ret;
	}
	if (dma_ctx->tx_ch_xfer) {
		ret = no_os_dma_xfer_start(xdesc->i3c_dma_desc->dma_desc,
					   xdesc->i3c_dma_desc->txdma_ch);
		if (ret)
			return ret;
	}

	/* Write Control buffer data to control register */
	ret = no_os_dma_xfer_start(xdesc->i3c_dma_desc->dma_desc,
				   xdesc->i3c_dma_desc->crdma_ch);
	if (ret)
		return ret;

	return 0;
}

/**
 * @brief Search for no_os_i3c_bus_desc by matching I3C_HandleTypeDef.
 * @param hi3c - The STM32 I3C bus descriptor.
 * @param iter - Iterator to store the I3C bus descriptor, NULL if not found.
 */
static inline void stm32_i3c_find_i3c_table(I3C_HandleTypeDef *hi3c,
		struct no_os_i3c_bus_desc **iter)
{
	struct stm32_i3c_bus_desc *sdesc;
	struct no_os_i3c_bus_desc **it;
	/*
	 * Find bus that triggered
	 */
	for (it = i3c_table; it < i3c_table + NO_OS_I3C_MAX_BUS_NUMBER; it++) {
		if (!*it)
			continue;

		sdesc = (*it)->extra;
		if (sdesc->hi3c == hi3c) {
			*iter = *it;
			return;
		}
	}
	*iter = NULL;
};

/**
 * @brief Halt execution until the I3C controller go to ready or error state.
 * @param hi3c - The STM32 I3C bus descriptor.
 * @return 0 on success and -EIO in case of error.
 */
static inline int32_t stm32_i3c_wait_ready(I3C_HandleTypeDef *hi3c)
{
	uint8_t state;

	state = HAL_I3C_GetState(hi3c);
	while (state != HAL_I3C_STATE_READY &&
	       state != HAL_I3C_STATE_LISTEN &&
	       state != HAL_I3C_STATE_ERROR) {
		state = HAL_I3C_GetState(hi3c);
	}

	return state == HAL_I3C_STATE_ERROR ? -EIO : 0;
};

/**
 * @brief DMA callback handler.
 * @param old_xfer - Completed DMA xfer descriptor.
 * @param next_xfer - DMA xfer descriptor to be configured.
 * @param ctx - The DMA callback context
 */
void stm32_i3c_dma_callback(struct no_os_dma_xfer_desc *old_xfer,
			    struct no_os_dma_xfer_desc *next_xfer,
			    void *ctx)
{
	struct stm32_i3c_dma_ctx *i3c_ctx;
	struct stm32_i3c_bus_desc *xdesc;

	i3c_ctx = (struct stm32_i3c_dma_ctx *) ctx;
	xdesc = (struct stm32_i3c_bus_desc *) i3c_ctx->desc->bus->extra;
	i3c_dma_cplt[i3c_ctx->desc->bus->device_id] = true;

	/* if more xfers pending dont do anything */
	if (next_xfer)
		return;

	/* If more control register are pending */
	if (xdesc->hi3c->ControlXferCount)
		return;

	/* Disable requested interrupts */
	__HAL_I3C_DISABLE_IT(xdesc->hi3c, (HAL_I3C_IT_FCIE | HAL_I3C_IT_ERRIE));
	/* Disable control DMA Request */
	LL_I3C_DisableDMAReq_Control(xdesc->hi3c->Instance);
	/* Disable Tx DMA Request */
	LL_I3C_DisableDMAReq_TX(xdesc->hi3c->Instance);
	/* Disable Rx DMA Request */
	LL_I3C_DisableDMAReq_RX(xdesc->hi3c->Instance);

	no_os_dma_xfer_abort(xdesc->i3c_dma_desc->dma_desc,
			     xdesc->i3c_dma_desc->crdma_ch);

	if (i3c_ctx->tx_ch_xfer) {
		no_os_dma_xfer_abort(xdesc->i3c_dma_desc->dma_desc,
				     xdesc->i3c_dma_desc->txdma_ch);
		no_os_free(i3c_ctx->tx_ch_xfer);
	}
	if (i3c_ctx->rx_ch_xfer) {
		no_os_dma_xfer_abort(xdesc->i3c_dma_desc->dma_desc,
				     xdesc->i3c_dma_desc->rxdma_ch);
		no_os_free(i3c_ctx->rx_ch_xfer);
	}

	/* Check on previous state */
	if (xdesc->hi3c->PreviousState == HAL_I3C_STATE_LISTEN) {
		/* Set state to listen */
		xdesc->hi3c->State = HAL_I3C_STATE_LISTEN;
	} else {
		/* Set state to ready */
		xdesc->hi3c->State = HAL_I3C_STATE_READY;
	}

	if (i3c_ctx->dma_user_cb)
		i3c_ctx->dma_user_cb(i3c_ctx->dma_user_ctx);

	no_os_free(i3c_ctx->cr_ch_xfer.src);
	no_os_free(i3c_ctx);

	/* Clear private data to indicate DMA transfer is completed */
	xdesc->i3c_dma_desc->priv = NULL;

	no_os_mutex_unlock(i3c_ctx->desc->bus->mutex);
}

/**
 * @brief Transfer complete callback handler.
 * @param hi3c - The STM32 I3C bus descriptor.
 * @return 0 on success and -EIO in case of error.
 */
static HAL_StatusTypeDef stm32_i3c_xfer_complete_cb(I3C_HandleTypeDef *hi3c,
		uint32_t itMasks)
{
	uint32_t dev_id;

	LL_I3C_ClearFlag_FC(hi3c->Instance);
	if (hi3c->ControlXferCount != 0U) {
		/*
		* Wait till the previous transaction is completed and the next
		* DMA transaction has been scheduled
		*/

		if (hi3c->Instance == I3C1) {
			dev_id = 1;
		} else {
			return HAL_ERROR;
		}

		while (i3c_dma_cplt[dev_id] == false);
		i3c_dma_cplt[dev_id] = false;

		/* Decrement remaining control buffer data counter */
		hi3c->ControlXferCount--;

		/* Then Initiate a Start condition */
		LL_I3C_RequestTransfer(hi3c->Instance);
	}

	return HAL_OK;
}

/**
 * @brief stm32 platform specific I3C platform ops structure.
 */
const struct no_os_i3c_platform_ops stm32_i3c_ops = {
	.i3c_ops_init_bus = &stm32_i3c_init_bus,
	.i3c_ops_init = &stm32_i3c_init,
	.i3c_ops_do_daa = &stm32_i3c_do_daa,
	.i3c_ops_send_ccc = &stm32_i3c_send_ccc,
	.i3c_ops_write = &stm32_i3c_write,
	.i3c_ops_read = &stm32_i3c_read,
	.i3c_ops_write_and_read = &stm32_i3c_write_and_read,
	.i3c_ops_remove_bus = &stm32_i3c_remove_bus,
	.i3c_ops_remove = &stm32_i3c_remove,
	.i3c_ops_is_dev_ready = &stm32_i3c_is_dev_ready,
	.i3c_ops_conf_irq = &stm32_i3c_conf_irq,
	.i3c_ops_get_ccc_info = &stm32_i3c_get_ccc_info,
	.i3c_ops_transfer_dma_async = &stm32_i3c_transfer_dma_async,
	.i3c_ops_transfer_abort = &stm32_i3c_transfer_abort,
};
